dadamachines/arduino-board-package/boards.txt
automat.name=automat
automat.vid.0=0x16D0
automat.pid.0=0x0CDA
automat.vid.1=0x16D0
automat.pid.1=0x0CDB
automat.build.vid=0x16D0
automat.build.pid=0x0CDB
automat.build.mcu=cortex-m0plus
automat.build.f_cpu=48000000L
automat.build.flags.optimize=-O3
automat.build.board=DADAMACHINES_AUTOMAT
automat.build.core=arduino
automat.build.variant=automat
automat.build.variant_system_lib=
automat.build.extra_flags=-D__SAMD21G18A__ -DARM_MATH_CM0PLUS -DDADAMACHINES_AUTOMAT {build.usb_flags}
automat.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
automat.build.usb_product="dadamachines automat"
automat.build.usb_manufacturer="dadamachines"
automat.build.usb_power=20
automat.upload.tool=bossac
automat.upload.protocol=sam-ba
automat.upload.maximum_size=262144
automat.upload.offset=0x2000
automat.upload.use_1200bps_touch=true
automat.upload.wait_for_upload_port=true
automat.upload.native_usb=true

doppler.name=doppler
doppler.vid.0=0x16D0
doppler.pid.0=0x0E3B
doppler.vid.1=0x16D0
doppler.pid.1=0x0E3C
doppler.build.vid=0x16D0
doppler.build.pid=0x0E3B
doppler.build.mcu=cortex-m4
doppler.build.f_cpu=120000000L
doppler.build.cache_flags=-DENABLE_CACHE
doppler.build.flags.optimize=-O3
doppler.build.usb_product="doppler"
doppler.build.usb_manufacturer="dadamachines"
doppler.build.usb_power=20
doppler.build.board=DADAMACHINES_DOPPLER
doppler.build.core=arduino
doppler.build.extra_flags=-D__SAMD51G19A__ -DDADAMACHINES_DOPPLER -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=12288
doppler.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
doppler.build.variant=doppler
doppler.build.variant_system_lib=
doppler.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
doppler.upload.tool=bossac
doppler.upload.protocol=sam-ba
doppler.upload.maximum_size=507904
doppler.upload.offset=0x4000
doppler.upload.use_1200bps_touch=true
doppler.upload.wait_for_upload_port=true
doppler.upload.native_usb=true
